In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

# CSV

In [2]:
dframe = pd.read_csv('cat.csv')

In [4]:
# first row are used as header
dframe

   q  r  s  t   apple
0  2  3  4  5    pear
1  a  s  d  f  rabbit
2  5  2  5  7     dog

In [6]:
dframe = pd.read_csv('cat.csv',header=None)
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [9]:
dframe = pd.read_table('cat.csv',sep=',',header=None)
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  a  s  d  f  rabbit
3  5  2  5  7     dog

In [10]:
dframe = pd.read_csv('cat.csv',header=None,nrows=2)
dframe

   0  1  2  3      4
0  q  r  s  t  apple
1  2  3  4  5   pear

In [11]:
# Auto generate abc.csv
dframe.to_csv('abc.csv')

In [12]:
# Print to stdout
import sys
dframe.to_csv(sys.stdout)

,0,1,2,3,4
0,q,r,s,t,apple
1,2,3,4,5,pear

In [13]:
dframe.to_csv(sys.stdout,sep='_')

_0_1_2_3_4
0_q_r_s_t_apple
1_2_3_4_5_pear

In [14]:
dframe.to_csv(sys.stdout,columns=[0,1,2])

,0,1,2
0,q,r,s
1,2,3,4

# JSON

In [16]:
json_obj = """
{"zoo_animal": "Lion",
 "food": ["Meat", "Veggies", "Honey"],
 "fur": "Golden",
 "clothes": null,
 "diet": [{"zoo_animal": "Gazelle","food": "grass", "fur": "brown"}]
}
"""

In [17]:
import json

In [20]:
data = json.loads(json_obj)
data

{'zoo_animal': 'Lion',
 'food': ['Meat', 'Veggies', 'Honey'],
 'fur': 'Golden',
 'clothes': None,
 'diet': [{'zoo_animal': 'Gazelle', 'food': 'grass', 'fur': 'brown'}]}

In [21]:
json.dumps(data)

'{"zoo_animal": "Lion", "food": ["Meat", "Veggies", "Honey"], "fur": "Golden", "clothes": null, "diet": [{"zoo_animal": "Gazelle", "food": "grass", "fur": "brown"}]}'

In [22]:
dframe = DataFrame(data['diet'])
dframe

  zoo_animal   food    fur
0    Gazelle  grass  brown